# Programming Assignment #3

## Jaqlyn Trazy B. Bernardo | 2ECE-C

In [1]:
# Import PANDAS
import pandas as pd

## Problem 2

In [2]:
# Read csv file
cars = pd.read_csv('cars.csv')

In [3]:
# Part A 
A = cars.loc[(cars.index < 5), # Get first 5 rows
            (cars.columns[1::2])] # Slice columns - starting at 1 with an increment of 2 
A

    mpg   disp  drat   qsec  am  carb
0  21.0  160.0  3.90  16.46   1     4
1  21.0  160.0  3.90  17.02   1     4
2  22.8  108.0  3.85  18.61   1     1
3  21.4  258.0  3.08  19.44   0     1
4  18.7  360.0  3.15  17.02   0     2

In [4]:
# Part B
B = cars.loc[(cars['Model'] == 'Mazda RX4')]
B

       Model   mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
0  Mazda RX4  21.0    6  160.0  110   3.9  2.62  16.46   0   1     4     4

In [7]:
# Part C
C = cars.loc[(cars['Model']=='Camaro Z28'), ['Model','cyl']]
C

         Model  cyl
23  Camaro Z28    8

In [15]:
# Part D
D = cars.loc[(cars['Model']=='Mazda RX4 Wag') | 
            (cars['Model']=='Ford Pantera L') | 
            (cars['Model']=='Honda Civic'), 
            ['Model','cyl','gear']]
D

             Model  cyl  gear
1    Mazda RX4 Wag    6     4
18     Honda Civic    4     4
28  Ford Pantera L    8     5